In [2]:
import pandas as pd

In [3]:
df=pd.read_csv(r"C:\Users\laksh\Downloads\confidence_transformed.csv")

In [4]:
df.head(5)

,Date,Description,Category,Cost,Currency,Surya,Ganesh Krishna Lakshmisetty,kanna karthik reddy,Sayed Mohammad Sohail,Gurudatta Tej Marupudi,K Nithin,Saimanassagar (removed),Sai Gopal (removed)
0,2022-11-02,Halal Chicken,Groceries,21.78,USD,-5.44,16.33,-5.44,-5.45,0.00,0.00,0.0,0.0
1,2022-11-03,American Fast Foods,General,5.19,USD,-1.30,-1.30,-1.29,3.89,0.00,0.00,0.0,0.0
2,2022-11-03,Uber_and_Lyft,Taxi,9.66,USD,7.24,-2.42,-2.41,-2.41,0.00,0.00,0.0,0.0
3,2022-11-03,Household,General,23.72,USD,-3.95,-3.95,-3.95,19.76,-3.96,-3.95,0.0,0.0
4,2022-11-04,Uber_and_Lyft,Taxi,33.01,USD,-5.50,-5.50,-5.51,-5.50,-5.50,27.51,0.0,0.0

## creating a new column to know who paid for the expense

In [5]:
df['Person_spent'] = df[['Surya', 'Ganesh Krishna Lakshmisetty', 'kanna karthik reddy',
                         'Sayed Mohammad Sohail', 'Gurudatta Tej Marupudi', 'K Nithin',
                         'Saimanassagar (removed)', 'Sai Gopal (removed)']].idxmax(axis=1)


df.head(5)

,Date,Description,Category,Cost,Currency,Surya,Ganesh Krishna Lakshmisetty,kanna karthik reddy,Sayed Mohammad Sohail,Gurudatta Tej Marupudi,K Nithin,Saimanassagar (removed),Sai Gopal (removed),Person_spent
0,2022-11-02,Halal Chicken,Groceries,21.78,USD,-5.44,16.33,-5.44,-5.45,0.00,0.00,0.0,0.0,Ganesh Krishna Lakshmisetty
1,2022-11-03,American Fast Foods,General,5.19,USD,-1.30,-1.30,-1.29,3.89,0.00,0.00,0.0,0.0,Sayed Mohammad Sohail
2,2022-11-03,Uber_and_Lyft,Taxi,9.66,USD,7.24,-2.42,-2.41,-2.41,0.00,0.00,0.0,0.0,Surya
3,2022-11-03,Household,General,23.72,USD,-3.95,-3.95,-3.95,19.76,-3.96,-3.95,0.0,0.0,Sayed Mohammad Sohail
4,2022-11-04,Uber_and_Lyft,Taxi,33.01,USD,-5.50,-5.50,-5.51,-5.50,-5.50,27.51,0.0,0.0,K Nithin

## Now dropping the columns of names

In [6]:

df.drop(columns=['Surya', 'Ganesh Krishna Lakshmisetty', 'kanna karthik reddy',
                 'Sayed Mohammad Sohail', 'Gurudatta Tej Marupudi', 'K Nithin',
                 'Saimanassagar (removed)', 'Sai Gopal (removed)'], inplace=True)

In [7]:
df.columns

Index(['Date', 'Description', 'Category', 'Cost', 'Currency', 'Person_spent'], dtype='object')

In [8]:
df.describe()

,Date,Description,Category,Cost,Currency,Person_spent
count,593,593,593,593,593,593
unique,216,60,15,467,1,8
top,2023-04-30,Indian groceries,General,12.00,USD,Sayed Mohammad Sohail
freq,17,124,280,10,593,126

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 593 entries, 0 to 592
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          593 non-null    object
 1   Description   593 non-null    object
 2   Category      593 non-null    object
 3   Cost          593 non-null    object
 4   Currency      593 non-null    object
 5   Person_spent  593 non-null    object
dtypes: object(6)
memory usage: 27.9+ KB

## Lets assign proper data types

In [10]:
df['Cost']=pd.to_numeric(df['Cost'])
df['Date']=pd.to_datetime(df['Date'])

ValueError: Unable to parse string " " at position 592

### replacing empty strings to nan values

In [11]:
import numpy as np

# Replace empty strings with NaN
df['Cost'] = df['Cost'].replace(r'^\s*$', np.nan, regex=True)


df['Cost'] = pd.to_numeric(df['Cost'])


df['Date'] = pd.to_datetime(df['Date'])

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 593 entries, 0 to 592
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          593 non-null    datetime64[ns]
 1   Description   593 non-null    object
 2   Category      593 non-null    object
 3   Cost          592 non-null    float64
 4   Currency      593 non-null    object
 5   Person_spent  593 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 27.9+ KB

## removing currency column as it is not required

In [13]:
df.drop(columns=['Currency'],inplace=True)

In [14]:
df.head(2)

,Date,Description,Category,Cost,Person_spent
0,2022-11-02,Halal Chicken,Groceries,21.78,Ganesh Krishna Lakshmisetty
1,2022-11-03,American Fast Foods,General,5.19,Sayed Mohammad Sohail

## checking duplicates

In [15]:
df.duplicated().sum()

2

In [16]:
df[df.duplicated(keep=False) == True]

          Date Description Category   Cost            Person_spent
284 2023-04-30   Household  General   1.25     kanna karthik reddy
285 2023-04-30   Household  General   1.25     kanna karthik reddy
560 2024-04-04         Gas    Gifts  25.00  Gurudatta Tej Marupudi
561 2024-04-04         Gas    Gifts  25.00  Gurudatta Tej Marupudi

In [17]:
df.drop_duplicates(inplace=True)

In [18]:
df.duplicated().sum()

0

## checking missing values

In [19]:
df.isnull().sum()

Date            0
Description     0
Category        0
Cost            1
Person_spent    0
dtype: int64

In [20]:
df[df["Cost"].isnull()]

          Date    Description Category  Cost            Person_spent
592 2024-05-02  total balance            NaN  Gurudatta Tej Marupudi

### looks like a inappropriate record based on description, so lets drop it

In [21]:
df.dropna(inplace=True)

In [22]:
df.head(10
        )

,Date,Description,Category,Cost,Person_spent
0,2022-11-02,Halal Chicken,Groceries,21.78,Ganesh Krishna Lakshmisetty
1,2022-11-03,American Fast Foods,General,5.19,Sayed Mohammad Sohail
2,2022-11-03,Uber_and_Lyft,Taxi,9.66,Surya
3,2022-11-03,Household,General,23.72,Sayed Mohammad Sohail
4,2022-11-04,Uber_and_Lyft,Taxi,33.01,K Nithin
5,2022-11-04,American Fast Foods,Dining out,16.22,K Nithin
6,2022-11-04,Household,General,3.75,K Nithin
7,2022-11-04,Costco & similar,Household supplies,3.64,K Nithin
8,2022-11-05,Walmart,Groceries,2.32,Sayed Mohammad Sohail
9,2022-11-05,Walmart,Groceries,51.04,Sayed Mohammad Sohail

## saving to csv

In [23]:
df.to_csv('cleaned_data.csv', index=False)